a = 25
b = 22
c = 22

a_b = 33
a_c = 32
b_c = 31
a_b_c_3 = 10
p = 40

a_b_2 = ((a + b) - a_b) - a_b_c_3  # учнів прочитали по 2 книжки а і b

a_c_2 = ((a + c) - a_c) - a_b_c_3  # учнів прочитали по 2 книжки а і c

b_c_2 = ((b + c) - b_c) - a_b_c_3  # учнів прочитали по 2 книжки а і c

a_1 = a - (a_c_2 + a_c_2 + a_b_c_3)  # учнів прочитали по 1 книжці а
b_1 = b - (a_b_2 + b_c_2 + a_b_c_3)  # учнів прочитали по 1 книжці b
c_1 = c - (a_c_2 + b_c_2 + a_b_c_3)  # учнів прочитали по 1 книжці c

a_b_c_1 = a_1 + b_1 + c_1  # всього учнів прочитали по 1 книжці
a_b_c_2 = a_b_2 + a_c_2 + b_c_2  # всього учнів прочитали по 2 книжки

ignore = p - (a_b_c_1 + a_b_c_2 + a_b_c_3)  # всього учнів не прочитали жодної книжки

print(f' {a_b_c_1} учнів прочитали по 1 книжці')
print(f' {a_b_c_2} учнів прочитали по 2 книжки')
print(f' {a_b_c_3} учнів прочитали по 3 книжки')
print(f' {ignore} учнів НЕ прочитали жодної книжки')
