print( " Привіт, я незвичний калькулятор ваги! \n Давайте спробуємо перевірити індекс маси вашого тіла!" )

name = input(" Але, спочатку напишіть як до Вас можна звертатись?: ")

print( "Ок, " + str (name) + "! Чудово, то ж розпочнемо!" )

sex = input( "Не зрозумів! Ви чоловік (ч) чи жінка (ж)!?,\n чи може інше (і)...?\n введіть, будь-ласка (ч/ж/і): " )

if sex != "ч" or "ж" or "і":
    input( "Ще раз! Не зрозумів! Ви чоловік (ч) чи жінка (ж)!?,\n чи може інше (і)...?\n введіть, будь-ласка (ч/ж/і): " )

age = input ( "Cкільки Вам вже стукнуло " + str (name) + "?: ")

if int (age) < 10:
   print( "О...та ти " + str (name) + " ще зовсім малий!...")
elif int (age) > 11 and int (age) < 30:
    print( "О.., "  + str (name) + " то ви в розквіті сил!..")
elif int (age) > 30 and int (age) < 60:
    print( "О.., "  + str (name) + " то ви людина з досвідом!...")
elif int (age) > 61 and int (age) < 100:
    print( "О.., "  + str (name) + " то навіщо Вам вже цей індекс!?...")
elif int (age) > 100:
    print( "Ого, "  + str (name) + ", а Ви часом не помилились...?!!!")
# elif age (доизучить тему м.б. валидации...):
    print( "О.., "  + str (name) + "введіть Ваш вік, і не клацайте більше клавіатуру!")

height = input( "Який Ваш зріст в сантиметрах? Наприклад, 178: " )

if int (height) > 220:
    print("Це неможлвиво!")
    height = input( "АУ!!! Корректно введіть Ваш зріст в сантиметрах! (наприклад 165): " )
else: print("Дякую! " + str(name))

weight = input("Яка Ваша вага? (тільки чесно!) ")

if int (weight) < 10:
   print( "Ого...!" + str (name) + " ВАС МАБУТЬ ЗДУВАЄ ВІД ВІТРУ!...")
elif int (weight) > 11 and int (weight) < 30:
    print( "Ого.., "  + str (name) + " ви що не їли півроку?!..")
elif int(weight) > 31 and int(weight) < 60:
    print("Так так.., " + str(name) + " мабуть ви на дієті!..")
elif int (weight) > 61 and int (weight) < 80:
    print( "Ок.., "  + str (name) + " зараз порахуємо!..")
elif int (weight) > 81 and int (weight) < 110:
    print( "Ого.., "  + str (name) + " мабуть Вам пора на дієту!\n Зараз порахуємо..")
elif int (weight) > 110:
    print( "Ого.., "  + str (name) + " ми з такою масою ще не стикалися!!!")

index = int (weight) / (int (int (height) * int (height))/10000)

print( "Індекс маси Вашого тіла: " + str (index))

if int (index) < 16:
   print( "Ого...!" + str (name) + " Викликайте швидку! Негайно! У Вас одні кістки залишились!...")
elif int (index) > 16 and int (index) < 18.5:
    print( "Ого.., "  + str (name) + " вітаю, Ви дистрофік! пора починати їсти сало! ..")
elif int (index) > 18.5 and int (index) < 25:
    print( "Ого.., "  + str (name) + " вітаю, Ви ідеальні! Можна зніматись в кіно..для дорослих...)))")
elif int (index) > 25 and int (index) < 30:
    print( "Не погано.., "  + str (name) + " але, час подумати про дієту!...")
elif int (index) > 30 and int (index) < 35:
    print( "Ого.., "  + str (name) + " вітаю, у Вас ожиріння 1 ступеня! Пора сідати на дієту! ..")
elif int (index) > 35 and int (index) < 40:
    print( "Ого.., "  + str (name) + "  у Вас ожиріння 2 ступеня! Пора сідати на дієту та почати хоча б присідати! ..")
elif int (index) > 40:
    print( "Ого.., "  + str (name) + "можете йти змагатись в боротьбі СУМО! Або...перестати їсти після 11 годинри ранку! ")

print("Дякую!")

# додати цикли!