while True:
    string = input('Введіть рядок смиволів (більше 15): ')
    l_string = len(string)
    if l_string > 15:
        print(f'Третій символ рядка: {string[2]}')
        print(f'Передостанній символ рядка: {string[-2]}')
        print(f"Перші п'ять символів рядка: {string[0:5]}")
        print(f'Рядок крім двох останніх символів: {string[0:-2]}')
        print(f"Парні індекси: {string[1::2]}")
        print(f"НЕ парні індекси: {string[0::2]}")
        print(f"Символи в зворотньому порядку: {string[::-1]}")
        print(f"Символи через один в зворотньому порядку: {string[-1:0:-2]}")

        print("*"*60)
        print('Дякую, cпробуйте ще!')

    else:
        print("Недостатня кількість введених симолів!")